In [2]:
import numpy as np
import pandas as pd

L = [1,2,3,4]
# L를 series로 변환(s)하여 인덱스(알파벳)으로 바꾸기

s = pd.Series(L, index = ['a','b','c','d'])

s

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
# s의 인덱스로 값 출력
s['b']

2

In [4]:
# s 값 바꾸기
s['c'] = 10

In [6]:
#  인덱스 여러가지 같이 값출력
s[['b','c']]

b     2
c    10
dtype: int64

In [7]:
#  s 비교 불값 출력
s > 5

a    False
b    False
c     True
d    False
dtype: bool

In [8]:
#  5 이상값 출력
s[s>5]

c    10
dtype: int64

In [9]:
# 각 값에 *2
s * 2

a     2
b     4
c    20
d     8
dtype: int64

In [10]:
# 'a'가 있는지 확인
'a' in s

True

In [12]:
# s 인덱스값 출력
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [14]:
# s value값 출력
s.values

array([ 1,  2, 10,  4], dtype=int64)

In [16]:
# s 인덱스 바꾸기
s.index = ['A','B','C','D']
s

A     1
B     2
C    10
D     4
dtype: int64

In [17]:
raw_data = {'first_name':['jason', np.nan, 'tina', 'jake', 'amy'],
           'last_name':['miller', np.nan, 'ali', 'miller', 'coozer'],
            'age':[42, np.nan, 36, 24, 73],
            'pretestscore' : [4, np.nan, np.nan, 2, 4],
            'posttestscre' : [25,np.nan, np.nan, 62,72]
           }

# 데이터 프레임 만들기
dt = pd.DataFrame(raw_data)
dt

  first_name last_name   age  pretestscore  posttestscre
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  36.0           NaN           NaN
3       jake    miller  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

In [18]:
# dt의 위에 2개값 출력
dt.head(2)

  first_name last_name   age  pretestscore  posttestscre
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN

In [19]:
#  df 특정column 출력
dt['last_name']

0    miller
1       NaN
2       ali
3    miller
4    coozer
Name: last_name, dtype: object

In [21]:
#  df 특정 column 2개 출력
dt[['first_name', 'age']]

  first_name   age
0      jason  42.0
1        NaN   NaN
2       tina  36.0
3       jake  24.0
4        amy  73.0

In [22]:
# dt age에 10 곱하기
dt['age'] = dt['age'].apply(lambda x:x *10)
dt

  first_name last_name    age  pretestscore  posttestscre
0      jason    miller  420.0           4.0          25.0
1        NaN       NaN    NaN           NaN           NaN
2       tina       ali  360.0           NaN           NaN
3       jake    miller  240.0           2.0          62.0
4        amy    coozer  730.0           4.0          72.0

In [25]:
# dt 인덱스 출력
dt.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
# dt value 값 출력
dt.columns

Index(['first_name', 'last_name', 'age', 'pretestscore', 'posttestscre'], dtype='object')

In [28]:
dt.values

array([['jason', 'miller', 420.0, 4.0, 25.0],
       [nan, nan, nan, nan, nan],
       ['tina', 'ali', 360.0, nan, nan],
       ['jake', 'miller', 240.0, 2.0, 62.0],
       ['amy', 'coozer', 730.0, 4.0, 72.0]], dtype=object)

In [32]:
#  인덱스 알파벳으로 바꾸기
dt.index = ['a','b','c','d','e']
dt

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0           2.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [33]:
# 특정 인덱스의 값 출력
dt.iloc[3]

first_name        jake
last_name       miller
age              240.0
pretestscore       2.0
posttestscre      62.0
Name: d, dtype: object

In [34]:
# 특정 이름의 값 출력
dt.loc['d']

first_name        jake
last_name       miller
age              240.0
pretestscore       2.0
posttestscre      62.0
Name: d, dtype: object

In [35]:
# 특정 인덱스부터 출력
dt.iloc[3:]

  first_name last_name    age  pretestscore  posttestscre
d       jake    miller  240.0           2.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [36]:
# 특정 이름부터 값 출력
dt.loc['b':]

  first_name last_name    age  pretestscore  posttestscre
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0           2.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [39]:
# 특정 이름의 값 두개 출력
dt.loc[['c','d']]

  first_name last_name    age  pretestscore  posttestscre
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0           2.0          62.0

In [40]:
# 특정 인덱스의 값 두개 출력
dt.iloc[[1,3]]

  first_name last_name    age  pretestscore  posttestscre
b        NaN       NaN    NaN           NaN           NaN
d       jake    miller  240.0           2.0          62.0

In [43]:
# 특정 이름의 범위 출력
dt.loc['b':'d']

  first_name last_name    age  pretestscore  posttestscre
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0           2.0          62.0

In [44]:
# 값 하나 출력
dt.iloc[0,3]

4.0

In [47]:
# 값 두개 이름 두개 출력
dt.loc[['c','d'],'age':'last_name']

Empty DataFrame
Columns: []
Index: [c, d]

In [50]:
# 값 바꾸기
dt.loc['d','pretestscore']=100
dt

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0         100.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [51]:
# 홀수번째 인덱스만
dt.iloc[1:5:2, :]

  first_name last_name    age  pretestscore  posttestscre
b        NaN       NaN    NaN           NaN           NaN
d       jake    miller  240.0         100.0          62.0

In [57]:
# 'last_name'이 'ali'인 사람의 데이터 추출
dt.loc[dt['last_name']== 'ali',"posttestscre"]

c   NaN
Name: posttestscre, dtype: float64

In [59]:
# 나이가 40 이상인 사람의 postestscore 평균점수는 얼마인가?
# df.loc[df['age'] >= 40]
dt.loc[dt['age']>= 40]['posttestscre'].mean()

53.0

In [60]:
# 새로운 칼럼 추가
dt['address']= ['seoul','incheon','daejeon','pusan','gwangju']
dt

  first_name last_name    age  pretestscore  posttestscre  address
a      jason    miller  420.0           4.0          25.0    seoul
b        NaN       NaN    NaN           NaN           NaN  incheon
c       tina       ali  360.0           NaN           NaN  daejeon
d       jake    miller  240.0         100.0          62.0    pusan
e        amy    coozer  730.0           4.0          72.0  gwangju

In [63]:
# 칼럼명 수정
dt.columns = ['fn','ln','age','pres','posts','add']
dt

      fn      ln    age   pres  posts      add
a  jason  miller  420.0    4.0   25.0    seoul
b    NaN     NaN    NaN    NaN    NaN  incheon
c   tina     ali  360.0    NaN    NaN  daejeon
d   jake  miller  240.0  100.0   62.0    pusan
e    amy  coozer  730.0    4.0   72.0  gwangju

In [67]:
# column 또는 row를 삭제
dt.drop('add', axis=1)

dt.drop('c')
dt.drop('add', axis=1, inplace=True)

In [71]:
L = [1,2,3,4]
# L를 series로 변환(s)하여 인덱스(알파벳)으로 바꾸기
df = pd.Series(L, index = ['a','b','c','d'])
df

a    1
b    2
c    3
d    4
dtype: int64

In [73]:
# s의 인덱스로 값 출력
df['a']

1

In [75]:
# s 값 바꾸기
df['b'] = 10
df

a     1
b    10
c     3
d     4
dtype: int64

In [79]:
#  인덱스 여러가지 같이 값출력
df[['b','c']]

b    10
c     3
dtype: int64

In [82]:
#  s 비교 불값 출력
df > 5

a    False
b     True
c    False
d    False
dtype: bool

In [83]:
#  5 이상값 출력
df[df>5]

b    10
dtype: int64

In [84]:
# 각 값에 *2
df * 2

a     2
b    20
c     6
d     8
dtype: int64

In [86]:
# 'a'가 있는지 확인
'a' in df

True

In [87]:
# s 인덱스값 출력
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [88]:
# s value값 출력
df.values

array([ 1, 10,  3,  4], dtype=int64)

In [90]:
# s 인덱스 바꾸기
df.index = ['가','나','다','라']
df

가     1
나    10
다     3
라     4
dtype: int64

In [115]:
raw_data = {'first_name':['jason', np.nan, 'tina', 'jake', 'amy'],
           'last_name':['miller', np.nan, 'ali', 'miller', 'coozer'],
            'age':[42, np.nan, 36, 24, 73],
            'pretestscore' : [4, np.nan, np.nan, 2, 4],
            'posttestscre' : [25,np.nan, np.nan, 62,72]
           }

# 데이터 프레임 만들기
dt = pd.DataFrame(raw_data)
dt

  first_name last_name   age  pretestscore  posttestscre
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  36.0           NaN           NaN
3       jake    miller  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

In [116]:
# dt의 위에 2개값 출력
dt.head(2)

  first_name last_name   age  pretestscore  posttestscre
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN

In [117]:
#  df 특정column 출력
dt['age']

0    42.0
1     NaN
2    36.0
3    24.0
4    73.0
Name: age, dtype: float64

In [118]:
#  df 특정 column 2개 출력
dt[['last_name','age']]

  last_name   age
0    miller  42.0
1       NaN   NaN
2       ali  36.0
3    miller  24.0
4    coozer  73.0

In [119]:
# dt age에 10 곱하기
dt['age']=dt['age'].apply(lambda x:x *10)
dt

  first_name last_name    age  pretestscore  posttestscre
0      jason    miller  420.0           4.0          25.0
1        NaN       NaN    NaN           NaN           NaN
2       tina       ali  360.0           NaN           NaN
3       jake    miller  240.0           2.0          62.0
4        amy    coozer  730.0           4.0          72.0

In [120]:
# dt 인덱스 출력
dt.index

RangeIndex(start=0, stop=5, step=1)

In [124]:
dt.index = ['a','b','c','d','e']

In [125]:
# dt value 값 출력
dt.values

array([['jason', 'miller', 420.0, 4.0, 25.0],
       [nan, nan, nan, nan, nan],
       ['tina', 'ali', 360.0, nan, nan],
       ['jake', 'miller', 240.0, 2.0, 62.0],
       ['amy', 'coozer', 730.0, 4.0, 72.0]], dtype=object)

In [126]:
# 특정 인덱스의 값 출력
dt.iloc[3]

first_name        jake
last_name       miller
age              240.0
pretestscore       2.0
posttestscre      62.0
Name: d, dtype: object

In [128]:
# 특정 이름의 값 출력
dt.loc['b']

first_name      NaN
last_name       NaN
age             NaN
pretestscore    NaN
posttestscre    NaN
Name: b, dtype: object

In [129]:
# 특정 인덱스부터 출력
dt.iloc[3:]

  first_name last_name    age  pretestscore  posttestscre
d       jake    miller  240.0           2.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [130]:
# 특정 이름부터 값 출력
dt.loc['b':]

  first_name last_name    age  pretestscore  posttestscre
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0           2.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [131]:
# 특정 이름의 값 두개 출력
dt.loc[['a','c']]

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
c       tina       ali  360.0           NaN           NaN

In [133]:
# 특정 인덱스의 값 두개 출력
dt.iloc[[1,3]]

  first_name last_name    age  pretestscore  posttestscre
b        NaN       NaN    NaN           NaN           NaN
d       jake    miller  240.0           2.0          62.0

In [134]:
# 특정 이름의 범위 출력
dt.loc['b':'c']

  first_name last_name    age  pretestscore  posttestscre
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN

In [138]:
# 값 하나 출력
dt.loc['d', 'age']

240.0

In [141]:
# 값 두개 이름 두개 출력
dt.loc[['a','c'], 'first_name':'last_name']

  first_name last_name
a      jason    miller
c       tina       ali

In [142]:
# 값 바꾸기
dt.loc['c']=100
dt

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
b        NaN       NaN    NaN           NaN           NaN
c        100       100  100.0         100.0         100.0
d       jake    miller  240.0           2.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [143]:
# 홀수번째 인덱스만
dt[::2]

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
c        100       100  100.0         100.0         100.0
e        amy    coozer  730.0           4.0          72.0

In [148]:
# 'last_name'이 'ali'인 사람의 데이터 추출
dt.loc[dt['last_name'] == 'ali','posttestscre']

Series([], Name: posttestscre, dtype: float64)

In [149]:
# 나이가 40 이상인 사람의 postestscore 평균점수는 얼마인가?
# df.loc[df['age'] >= 40]
dt[dt['age'] >= 40 ]['posttestscre'].mean()

64.75

In [ ]:
# 새로운 칼럼 추가
dt['address']=['서울','인청','부산','대구','경기']
dt

# 칼럼명 수정

In [152]:
# 칼럼명 수정
dt.columns = ['fn','ln','age','pre','pos','add']
dt

      fn      ln    age    pre    pos add
a  jason  miller  420.0    4.0   25.0  서울
b    NaN     NaN    NaN    NaN    NaN  인청
c    100     100  100.0  100.0  100.0  부산
d   jake  miller  240.0    2.0   62.0  대구
e    amy  coozer  730.0    4.0   72.0  경기

In [154]:
# column 또는 row를 삭제
dt.rename(columns = {'add':'address'})
dt

      fn      ln    age    pre    pos add
a  jason  miller  420.0    4.0   25.0  서울
b    NaN     NaN    NaN    NaN    NaN  인청
c    100     100  100.0  100.0  100.0  부산
d   jake  miller  240.0    2.0   62.0  대구
e    amy  coozer  730.0    4.0   72.0  경기

In [6]:
L = [1,2,3,4]
# L를 series로 변환(s)하여 인덱스(알파벳)으로 바꾸기
import pandas as pd
import numpy as np

s = pd.Series(L, index = ['a','b','c','d'])

In [7]:
# s의 인덱스로 값 출력
s[3]

4

In [8]:
# s 값 바꾸기
s[3] = 10

In [9]:
#  인덱스 여러가지 같이 값출력
s[['a','c']]

a    1
c    3
dtype: int64

In [10]:
#  s 비교 불값 출력
s > 5

a    False
b    False
c    False
d     True
dtype: bool

In [11]:
#  5 이상값 출력
s[s>5]

d    10
dtype: int64

In [12]:
# 각 값에 *2
s*2

a     2
b     4
c     6
d    20
dtype: int64

In [13]:
# 'a'가 있는지 확인
'a' in s

True

In [14]:
# s 인덱스값 출력
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [16]:
# s value값 출력
s.values

array([ 1,  2,  3, 10], dtype=int64)

In [17]:
# s 인덱스 바꾸기
s.index = ['가','나','다','라']

In [19]:
raw_data = {'first_name':['jason', np.nan, 'tina', 'jake', 'amy'],
           'last_name':['miller', np.nan, 'ali', 'miller', 'coozer'],
            'age':[42, np.nan, 36, 24, 73],
            'pretestscore' : [4, np.nan, np.nan, 2, 4],
            'posttestscore' : [25,np.nan, np.nan, 62,72]
           }

# 데이터 프레임 만들기
tt = pd.DataFrame(raw_data)
tt

  first_name last_name   age  pretestscore  posttestscore
0      jason    miller  42.0           4.0           25.0
1        NaN       NaN   NaN           NaN            NaN
2       tina       ali  36.0           NaN            NaN
3       jake    miller  24.0           2.0           62.0
4        amy    coozer  73.0           4.0           72.0

In [20]:
# dt의 위에 2개값 출력
tt.head(2)

  first_name last_name   age  pretestscore  posttestscore
0      jason    miller  42.0           4.0           25.0
1        NaN       NaN   NaN           NaN            NaN

In [23]:
#  df 특정column 출력
tt.columns

Index(['first_name', 'last_name', 'age', 'pretestscore', 'posttestscore'], dtype='object')

In [24]:
#  df 특정 column 2개 출력
tt[['last_name','age']]

  last_name   age
0    miller  42.0
1       NaN   NaN
2       ali  36.0
3    miller  24.0
4    coozer  73.0

In [25]:
# dt age에 10 곱하기
tt['age']*10

0    420.0
1      NaN
2    360.0
3    240.0
4    730.0
Name: age, dtype: float64

In [28]:
# dt 인덱스 출력
tt.index = ['a','b','c','d','e']
tt.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [29]:
# dt value 값 출력
tt.values

array([['jason', 'miller', 42.0, 4.0, 25.0],
       [nan, nan, nan, nan, nan],
       ['tina', 'ali', 36.0, nan, nan],
       ['jake', 'miller', 24.0, 2.0, 62.0],
       ['amy', 'coozer', 73.0, 4.0, 72.0]], dtype=object)

In [33]:
# 특정 인덱스의 값 출력
tt.iloc[3]

first_name         jake
last_name        miller
age                24.0
pretestscore        2.0
posttestscore      62.0
Name: d, dtype: object

In [34]:
# 특정 이름의 값 출력
tt.loc['a']

first_name        jason
last_name        miller
age                42.0
pretestscore        4.0
posttestscore      25.0
Name: a, dtype: object

In [35]:
# 특정 인덱스부터 출력
tt.iloc[2:]

  first_name last_name   age  pretestscore  posttestscore
c       tina       ali  36.0           NaN            NaN
d       jake    miller  24.0           2.0           62.0
e        amy    coozer  73.0           4.0           72.0

In [37]:
# 특정 이름부터 값 출력
tt.loc['b':]

  first_name last_name   age  pretestscore  posttestscore
b        NaN       NaN   NaN           NaN            NaN
c       tina       ali  36.0           NaN            NaN
d       jake    miller  24.0           2.0           62.0
e        amy    coozer  73.0           4.0           72.0

In [38]:
# 특정 이름의 값 두개 출력
tt.loc[['a','c']]

  first_name last_name   age  pretestscore  posttestscore
a      jason    miller  42.0           4.0           25.0
c       tina       ali  36.0           NaN            NaN

In [39]:
# 특정 인덱스의 값 두개 출력
tt.iloc[[2,4]]

  first_name last_name   age  pretestscore  posttestscore
c       tina       ali  36.0           NaN            NaN
e        amy    coozer  73.0           4.0           72.0

In [40]:
# 특정 이름의 범위 출력
tt.loc['a':'d']

  first_name last_name   age  pretestscore  posttestscore
a      jason    miller  42.0           4.0           25.0
b        NaN       NaN   NaN           NaN            NaN
c       tina       ali  36.0           NaN            NaN
d       jake    miller  24.0           2.0           62.0

In [41]:
# 값 하나 출력
tt.loc['b','posttestscore']

nan

In [43]:
# 값 두개 이름 두개 출력
tt.loc[['a','c'],'last_name':'age']

  last_name   age
a    miller  42.0
c       ali  36.0

In [44]:
# 값 바꾸기
tt.loc['c', 'pretestscore']=10

In [45]:
# 홀수번째 인덱스만
tt.iloc[::2]                  # 무러보깅

  first_name last_name   age  pretestscore  posttestscore
a      jason    miller  42.0           4.0           25.0
c       tina       ali  36.0          10.0            NaN
e        amy    coozer  73.0           4.0           72.0

In [51]:
# 'last_name'이 'ali'인 사람의 데이터 추출
tt.loc[tt['last_name']=='ali']

  first_name last_name   age  pretestscore  posttestscore
c       tina       ali  36.0          10.0            NaN

In [50]:
# 나이가 40 이상인 사람의 postestscore 평균점수는 얼마인가?
# df.loc[df['age'] >= 40]
tt.loc[tt['age'] >= 40, 'posttestscore']

a    25.0
e    72.0
Name: posttestscore, dtype: float64

In [54]:
# 새로운 칼럼 추가
tt['address'] = ['서울', '대전', '대구', '부산', '찍고']
tt

  first_name last_name   age  pretestscore  posttestscore address
a      jason    miller  42.0           4.0           25.0      서울
b        NaN       NaN   NaN           NaN            NaN      대전
c       tina       ali  36.0          10.0            NaN      대구
d       jake    miller  24.0           2.0           62.0      부산
e        amy    coozer  73.0           4.0           72.0      찍고

In [ ]:
L = [1,2,3,4]
# L를 series로 변환(s)하여 인덱스(알파벳)으로 바꾸기

# s의 인덱스로 값 출력

# s 값 바꾸기

#  인덱스 여러가지 같이 값출력

#  s 비교 불값 출력

#  5 이상값 출력

# 각 값에 *2

# 'a'가 있는지 확인

# s 인덱스값 출력

# s value값 출력

# s 인덱스 바꾸기

raw_data = {'first_name':['jason', np.nan, 'tina', 'jake', 'amy'],
           'last_name':['miller', np.nan, 'ali', 'miller', 'coozer'],
            'age':[42, np.nan, 36, 24, 73],
            'pretestscore' : [4, np.nan, np.nan, 2, 4],
            'posttestscre' : [25,np.nan, np.nan, 62,72]
           }

# 데이터 프레임 만들기

# dt의 위에 2개값 출력

#  df 특정column 출력

#  df 특정 column 2개 출력

# dt age에 10 곱하기

# dt 인덱스 출력

# dt value 값 출력

# 특정 인덱스의 값 출력

# 특정 이름의 값 출력

# 특정 인덱스부터 출력

# 특정 이름부터 값 출력

# 특정 이름의 값 두개 출력

# 특정 인덱스의 값 두개 출력

# 특정 이름의 범위 출력

# 값 하나 출력

# 값 두개 이름 두개 출력

# 값 바꾸기

# 홀수번째 인덱스만

# 'last_name'이 'ali'인 사람의 데이터 추출

# 나이가 40 이상인 사람의 postestscore 평균점수는 얼마인가?
# df.loc[df['age'] >= 40]

# 새로운 칼럼 추가